dorf.org
#+TITLE: Dorf's epic emacs config
#+OPTIONS: toc:4 h:4

* EMACS configuration
  My emacs config is split among seperate files handling different topics, this file is the main index for navigation

** initialization

*** Package managers and repositories
    Setup the package manager and add repositories eg. melpa etc.
#+begin_src emacs-lisp
; start package.el for emacs to handle packages
(require 'package)
;;; Packages repo, can't really live without melpa rite?
(when (>= emacs-major-version 24)
   (require 'package)
    (package-initialize)
     (add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/") t)
      )
#+end_src

*** Load sections
    Here I'll load all the files in a specific order
#+begin_src emacs-lisp
(load "~/.emacs.d/functions.el")
(load "~/.emacs.d/settings.el")
(load "~/.emacs.d/graphical.el")
(load "~/.emacs.d/personal.el")
(load "~/.emacs.d/modules.el")
(load "~/.emacs.d/programming.el")
(load "~/.emacs.d/keybindings.el")
(load "~/.emacs.d/misc.el")
#+end_src



#+begin_src emacs-lisp

#+end_src
